{"PAD": 0, "rest": 1, "G4": 2, "G4 hold": 3, "D5": 4, "D5 hold": 5, "B4": 6, "B4 hold": 7, "A4": 8, "A4 hold": 9, "C5": 10, "C5 hold": 11, "D4": 12, "D4 hold": 13, "E4": 14, "E4 hold": 15, "B3": 16, "B3 hold": 17, "F#4": 18, "F#4 hold": 19, "F4": 20, "F4 hold": 21, "C4": 22, "C4 hold": 23, "A3": 24, "A3 hold": 25, "G3": 26, "G3 hold": 27, "F#3": 28, "F#3 hold": 29, "G2": 30, "G2 hold": 31, "E3": 32, "E3 hold": 33, "D3": 34, "D3 hold": 35, "C3": 36, "C3 hold": 37, "B2": 38, "B2 hold": 39, "A2": 40, "A2 hold": 41, "F#2": 42, "F#2 hold": 43, "C#5": 44, "C#5 hold": 45, "G#4": 46, "G#4 hold": 47, "E5": 48, "E5 hold": 49, "A#4": 50, "A#4 hold": 51, "D#4": 52, "D#4 hold": 53, "C#4": 54, "C#4 hold": 55, "G#3": 56, "G#3 hold": 57, "A#3": 58, "A#3 hold": 59, "C#3": 60, "C#3 hold": 61, "D#3": 62, "D#3 hold": 63, "E2": 64, "E2 hold": 65, "B-3": 66, "B-3 hold": 67, "F3": 68, "F3 hold": 69, "D#5": 70, "D#5 hold": 71, "E#4": 72, "E#4 hold": 73, "E#3": 74, "E#3 hold": 75, "A#2": 76, "A#2 hold": 77, "G#2": 78, "G#2 hold": 79, "B-4": 80, "B-4 hold": 81, "F5": 82, "F5 hold": 83, "F2": 84, "F2 hold": 85, "E-3": 86, "E-3 hold": 87, "B-2": 88, "B-2 hold": 89, "A-4": 90, "A-4 hold": 91, "D-5": 92, "D-5 hold": 93, "E-5": 94, "E-5 hold": 95, "E-4": 96, "E-4 hold": 97, "A-3": 98, "A-3 hold": 99, "D-4": 100, "D-4 hold": 101, "G-4": 102, "G-4 hold": 103, "D-3": 104, "D-3 hold": 105, "A-2": 106, "A-2 hold": 107, "F#5": 108, "F#5 hold": 109, "G5": 110, "G5 hold": 111, "D2": 112, "D2 hold": 113, "A5": 114, "A5 hold": 115, "E#5": 116, "E#5 hold": 117, "B#3": 118, "B#3 hold": 119, "C2": 120, "C2 hold": 121, "B#4": 122, "B#4 hold": 123, "F##2": 124, "F##2 hold": 125, "E#2": 126, "E#2 hold": 127, "G-3": 128, "G-3 hold": 129, "E-2": 130, "E-2 hold": 131, "B#2": 132, "B#2 hold": 133, "A-5": 134, "A-5 hold": 135, "F-4": 136, "F-4 hold": 137, "C-4": 138, "C-4 hold": 139, "C-3": 140, "C-3 hold": 141, "G-2": 142, "G-2 hold": 143, "G#5": 144, "G#5 hold": 145, "B5": 146, "B5 hold": 147, "C#2": 148, "C#2 hold": 149, "D6": 150, "D6 hold": 151, "C6": 152, "C6 hold": 153, "B-5": 154, "B-5 hold": 155, "F##4": 156, "F##4 hold": 157, "F##3": 158, "F##3 hold": 159, "D#2": 160, "D#2 hold": 161, "C#6": 162, "C#6 hold": 163, "A#5": 164, "A#5 hold": 165, "E6": 166, "E6 hold": 167, "G-5": 168, "G-5 hold": 169}